export const HOT_KEYS = [
	{
		title: 'історія буферу обміну',
		buttons: ['⌘', '⇧', 'V'],
	},
	{
		title: 'пошук по всьому проекті',
		buttons: ['⌘', '⇧', 'F'],
	},
	{
		title: 'заміна у всьому проекті',
		buttons: ['⌘', '⇧', 'R'],
	},
	{
		title: 'зміна регістру',
		buttons: ['⌘', '⇧', 'U'],
	},
	{
		title: 'обгортка коду в блок if/for/try...',
		buttons: ['⌘', '⌥', 'T'],
	},
	{
		title: 'переміщення куска коду у функцію/з функції',
		buttons: ['⌘', '⌥', 'M'],
	},
	{
		title: 'винесення в змінну',
		buttons: ['⌘', '⌥', 'V'],
	},
	{
		title: 'переміщення в параметр функції',
		buttons: ['⌘', '⌥', 'P'],
	},
	{
		title: 'швидка зміна сигнатури функції',
		buttons: ['⌘', 'F6'],
	},
	{
		title: 'заміна у файлі',
		buttons: ['⌘', 'R'],
	},
	{
		title: 'пошук у файлі',
		buttons: ['⌘', 'F'],
	},
	{
		title: 'перегляд нащодавніх файлів',
		buttons: ['⌘', 'E'],
	},
	{
		title: 'копіювання виділеного блоку',
		buttons: ['⌘', 'D'],
	},
	{
		title: 'закоментувати',
		buttons: ['⌘', '/'],
	},
	{
		title: 'шифт вниз',
		buttons: ['⇧', '↵'],
	},
	{
		title: 'пошук по імені файлу',
		buttons: ['⇧', '⇧'],
	},
	{
		title: 'швидкий рефактор імені у всіх файлах (інколи з fn)',
		buttons: ['⇧', 'F6'],
	},
	{
		title: 'шифт вверх',
		buttons: ['⌥', '⌘', '↵'],
	},
	{
		title: 'зростаючий вибір коду',
		buttons: ['⌥', '↑'],
	},
	{
		title: 'зменшуючий вибір коду',
		buttons: ['⌥', '↓'],
	},
	{
		title: 'перегляд де використовується хук/функція/const...',
		buttons: ['⌥', 'F7'],
	},
	{
		title: 'виділити всі збіги у файлі',
		buttons: ['⌃', '⇧', 'G'],
	},
]

// ⌘ Command (or Cmd)
// ⇧ Shift
// ⌥ Option (or Alt)
// ⌃ Control (or Ctrl)
// ←, →, ↑, ↓
// ↵
